modm-ext/data.modm.io/docs/svd/header_stm32l162xe.svd
        <register>
          <name>SMPR2</name>
          <description>ADC sample time register 2</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SMP10</name>
              <description>ADC channel 10 sampling time selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP11</name>
              <description>ADC channel 11 sampling time selection</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP12</name>
              <description>ADC channel 12 sampling time selection</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP13</name>
              <description>ADC channel 13 sampling time selection</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP14</name>
              <description>ADC channel 14 sampling time selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP15</name>
              <description>ADC channel 5 sampling time selection</description>
              <bitOffset>15</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP16</name>
              <description>ADC channel 16 sampling time selection</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP17</name>
              <description>ADC channel 17 sampling time selection</description>
              <bitOffset>21</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP18</name>
              <description>ADC channel 18 sampling time selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP19</name>
              <description>ADC channel 19 sampling time selection</description>
              <bitOffset>27</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPR3</name>
          <description>ADC sample time register 3</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SMP0</name>
              <description>ADC channel 0 sampling time selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP1</name>
              <description>ADC channel 1 sampling time selection</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP2</name>
              <description>ADC channel 2 sampling time selection</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP3</name>
              <description>ADC channel 3 sampling time selection</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP4</name>
              <description>ADC channel 4 sampling time selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP5</name>
              <description>ADC channel 5 sampling time selection</description>
              <bitOffset>15</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP6</name>
              <description>ADC channel 6 sampling time selection</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP7</name>
              <description>ADC channel 7 sampling time selection</description>
              <bitOffset>21</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP8</name>
              <description>ADC channel 8 sampling time selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP9</name>
              <description>ADC channel 9 sampling time selection</description>
              <bitOffset>27</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>JOFR1</name>
          <description>ADC injected channel data</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>JOFFSET1</name>
              <description>ADC group injected sequencer rank 1 offset value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>JOFR2</name>
          <description>ADC injected channel data</description>
          <addressOffset>0x1c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>JOFFSET2</name>
              <description>ADC group injected sequencer rank 2 offset value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>JOFR3</name>
          <description>ADC injected channel data</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>JOFFSET3</name>
              <description>ADC group injected sequencer rank 3 offset value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>JOFR4</name>
          <description>ADC injected channel data</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>JOFFSET4</name>
              <description>ADC group injected sequencer rank 4 offset value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HTR</name>
          <description>ADC watchdog higher threshold register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HT</name>
              <description>ADC analog watchdog 1 threshold high</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LTR</name>
          <description>ADC watchdog lower threshold register</description>
          <addressOffset>0x2c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LT</name>
              <description>ADC analog watchdog 1 threshold low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SQR1</name>
          <description>ADC regular sequence register 1</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SQ25</name>
              <description>ADC group regular sequencer rank 25</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SQ26</name>
              <description>ADC group regular sequencer rank 26</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SQ27</name>
              <description>ADC group regular sequencer rank 27</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SQ28</name>
              <description>ADC group regular sequencer rank 28</description>
              <bitOffset>15</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>L</name>
              <description>ADC group regular sequencer scan length</description>
              <bitOffset>20</bitOffset>
              <bitWidth>5</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>ADC group regular sequencer disable (equivalent to sequencer of 1 rank: ADC conversion on only 1 channel)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_2RANKS</name>
                  <description>ADC group regular sequencer enable with 2 ranks in the sequence</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_3RANKS</name>
                  <description>ADC group regular sequencer enable with 3 ranks in the sequence</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_4RANKS</name>
                  <description>ADC group regular sequencer enable with 4 ranks in the sequence</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_5RANKS</name>
                  <description>ADC group regular sequencer enable with 5 ranks in the sequence</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_6RANKS</name>
                  <description>ADC group regular sequencer enable with 6 ranks in the sequence</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_7RANKS</name>
                  <description>ADC group regular sequencer enable with 7 ranks in the sequence</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_8RANKS</name>
                  <description>ADC group regular sequencer enable with 8 ranks in the sequence</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_9RANKS</name>
                  <description>ADC group regular sequencer enable with 9 ranks in the sequence</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_10RANKS</name>
                  <description>ADC group regular sequencer enable with 10 ranks in the sequence</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_11RANKS</name>
                  <description>ADC group regular sequencer enable with 11 ranks in the sequence</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_12RANKS</name>
                  <description>ADC group regular sequencer enable with 12 ranks in the sequence</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_13RANKS</name>
                  <description>ADC group regular sequencer enable with 13 ranks in the sequence</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_14RANKS</name>
                  <description>ADC group regular sequencer enable with 14 ranks in the sequence</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_15RANKS</name>
                  <description>ADC group regular sequencer enable with 15 ranks in the sequence</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_16RANKS</name>
                  <description>ADC group regular sequencer enable with 16 ranks in the sequence</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_17RANKS</name>
                  <description>ADC group regular sequencer enable with 17 ranks in the sequence</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_19RANKS</name>
                  <description>ADC group regular sequencer enable with 19 ranks in the sequence</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_20RANKS</name>
                  <description>ADC group regular sequencer enable with 20 ranks in the sequence</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_21RANKS</name>
                  <description>ADC group regular sequencer enable with 21 ranks in the sequence</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_22RANKS</name>
                  <description>ADC group regular sequencer enable with 22 ranks in the sequence</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_23RANKS</name>
                  <description>ADC group regular sequencer enable with 23 ranks in the sequence</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_24RANKS</name>
                  <description>ADC group regular sequencer enable with 24 ranks in the sequence</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_25RANKS</name>
                  <description>ADC group regular sequencer enable with 25 ranks in the sequence</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_26RANKS</name>
                  <description>ADC group regular sequencer enable with 26 ranks in the sequence</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_27RANKS</name>
                  <description>ADC group regular sequencer enable with 27 ranks in the sequence</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_28RANKS</name>
                  <description>ADC group regular sequencer enable with 28 ranks in the sequence</description>
                  <value>27</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SQR2</name>
          <description>ADC regular sequence register 2</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SQ19</name>
              <description>ADC group regular sequencer rank 19</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SQ20</name>
              <description>ADC group regular sequencer rank 20</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SQ21</name>
              <description>ADC group regular sequencer rank 21</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SQ22</name>
              <description>ADC group regular sequencer rank 22</description>
              <bitOffset>15</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SQ23</name>
              <description>ADC group regular sequencer rank 23</description>
              <bitOffset>20</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SQ24</name>
              <description>ADC group regular sequencer rank 24</description>
              <bitOffset>25</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SQR3</name>
          <description>ADC regular sequence register 3</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SQ13</name>
              <description>ADC group regular sequencer rank 13</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SQ14</name>
              <description>ADC group regular sequencer rank 14</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SQ15</name>
              <description>ADC group regular sequencer rank 15</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SQ16</name>
              <description>ADC group regular sequencer rank 16</description>
              <bitOffset>15</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SQ17</name>
              <description>ADC group regular sequencer rank 17</description>
              <bitOffset>20</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SQ18</name>
              <description>ADC group regular sequencer rank 18</description>
              <bitOffset>25</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SQR4</name>
          <description>ADC regular sequence register 4</description>
          <addressOffset>0x3c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SQ7</name>
              <description>ADC group regular sequencer rank 7</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SQ8</name>
              <description>ADC group regular sequencer rank 8</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SQ9</name>
              <description>ADC group regular sequencer rank 9</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SQ10</name>
              <description>ADC group regular sequencer rank 10</description>
              <bitOffset>15</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SQ11</name>
              <description>ADC group regular sequencer rank 11</description>
              <bitOffset>20</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SQ12</name>
              <description>ADC group regular sequencer rank 12</description>
              <bitOffset>25</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SQR5</name>
          <description>ADC regular sequence register 5</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SQ1</name>
              <description>ADC group regular sequencer rank 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SQ2</name>
              <description>ADC group regular sequencer rank 2</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SQ3</name>
              <description>ADC group regular sequencer rank 3</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SQ4</name>
              <description>ADC group regular sequencer rank 4</description>
              <bitOffset>15</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SQ5</name>
              <description>ADC group regular sequencer rank 5</description>
              <bitOffset>20</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SQ6</name>
              <description>ADC group regular sequencer rank 6</description>
              <bitOffset>25</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
